app/models/SocialProfile.php

SELECT * FROM `user_social` WHERE `id`='1'
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);